quest_system_2001878666_name=^?^Archmage Rezo
quest_system_2001878666_stage_0=^?^Go upstairs to the third floor of the Magic Tower, and subdue the Staff of Destruction.
quest_system_2001878666_stage_1=^?^Return the Staff to the Archmage.
quest_system_2001878666_task=^?^The Staff of the Archmage Rezo has gone out of control. The Archmage asks you to go to the upper floor of his Tower and suppress the Staff.<br>[reward]
